In [5]:
import pandas as pd

df = pd.DataFrame({'course_name ': ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer'], 'duration' : [2,3,6,4]})

In [6]:
df

       course_name   duration
0      Data Science         2
1  Machine Learning         3
2          Big Data         6
3     Data Engineer         4

In [25]:
# Q1
df.iloc[1]

course_name     Machine Learning
duration                       3
Name: 1, dtype: object

In [26]:
# #Q2.
# loc and iloc are methods in pandas that help you access specific rows and columns in a DataFrame.

# loc is used to select data based on its label (such as the row and column names) while iloc is used to select data based
# on its position (such as the row and column index numbers).

# So, if you want to select data based on the names of the rows and columns, you would use loc, and if you want to select 
# data based on the position of the rows and columns, you would use iloc.

In [37]:
#Q3.
# Reindex the given dataframe using a variable, reindex = [3,0,1,2] and store it in the variable, new_df
# then find the output for both new_df.loc[2] and new_df.iloc[2].
import pandas as pd

new_df = pd.DataFrame({'course_name ': ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer'],
                       'duration' : [2,3,6,4]},
                       index = [3,0,1,2]
                     )

In [38]:
new_df

       course_name   duration
3      Data Science         2
0  Machine Learning         3
1          Big Data         6
2     Data Engineer         4

In [39]:
new_df.loc[2] #The loc method is used to access rows of a DataFrame using the index labels. In this case, we pass the label
# 2 to the loc method to access the row with index label 2.

course_name     Data Engineer
duration                    4
Name: 2, dtype: object

In [40]:
new_df.iloc[2] #The iloc method is used to access rows of a DataFrame using the integer position. In this case, we pass the
# integer 2 to the iloc method to access the third row of the new DataFram

course_name     Big Data
duration               6
Name: 1, dtype: object

In [95]:
#Another Question
import pandas as pd
import numpy as np

# generate random data
data = np.random.rand(6, 6)

# create a DataFrame with random data
df1 = pd.DataFrame(data, columns=['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6'], 
                   index=[1, 2, 3, 4, 5, 6])

In [76]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.229272  0.210700  0.060730  0.931219  0.685710  0.219518
2  0.368545  0.416284  0.331735  0.912163  0.288284  0.080777
3  0.897412  0.732776  0.757395  0.320775  0.291422  0.570412
4  0.971484  0.978716  0.360693  0.865728  0.912149  0.059090
5  0.595746  0.444684  0.475196  0.129479  0.031694  0.718456
6  0.956284  0.130644  0.372472  0.868914  0.488080  0.428182

In [77]:
# (i) mean of each and every column present in the dataframe.
column_means = df1.mean()

In [80]:
column_means

column_1    0.669790
column_2    0.485634
column_3    0.393037
column_4    0.671380
column_5    0.449557
column_6    0.346072
dtype: float64

In [78]:
# (ii) standard deviation of column, ‘column_2’
column_deviation = df1.std()

In [79]:
column_deviation

column_1    0.320997
column_2    0.320094
column_3    0.225904
column_4    0.351814
column_5    0.315236
column_6    0.269999
dtype: float64

In [86]:
# Q5. Replace the data present in the second row of column, ‘column_2’ by a string variable then find the
# mean of column, column_2.
# If you are getting errors in executing it then explain why.
# [Hint: To replace the data use df1.loc[] and equate this to string data of your choice.]
df1.loc[2, 'column_2'] = 'new_value'

In [87]:
df1

   column_1   column_2  column_3  column_4  column_5  column_6
1  0.229272     0.2107  0.060730  0.931219  0.685710  0.219518
2  0.368545  new_value  0.331735  0.912163  0.288284  0.080777
3  0.897412   0.732776  0.757395  0.320775  0.291422  0.570412
4  0.971484   0.978716  0.360693  0.865728  0.912149  0.059090
5  0.595746   0.444684  0.475196  0.129479  0.031694  0.718456
6  0.956284   0.130644  0.372472  0.868914  0.488080  0.428182

In [96]:
column2_means = df1['column_2'].

In [97]:
column2_means

0.589346885785685

In [98]:
# Q6.
# In Pandas, a window function is a way to perform calculations on a specific subset of a larger dataset called a "window".
# A window can be defined using various methods such as moving averages or rolling windows. These functions allow you to
# compute aggregate statistics like mean, sum, min, max, etc. on subsets of your data.

# Types of Window Functions in Pandas:

# Rolling Window Functions:
# Rolling window functions in Pandas operate on a rolling window of a specified size that moves across the data frame. 
# These functions can be used to calculate moving statistics like rolling mean, rolling sum, rolling median, rolling standard
# deviation, and so on.

# Expanding Window Functions:
# Expanding window functions in Pandas perform calculations on an expanding window of data from the start of the dataset to 
# the current row. These functions can be used to calculate statistics like expanding mean, expanding sum, and so on.

# Exponential Weighted Window Functions:
# Exponential weighted window functions in Pandas perform calculations on an exponentially weighted moving average of a
# specified size. These functions can be used to calculate exponentially weighted statistics like exponentially weighted 
# moving average, exponentially weighted standard deviation, and so on.

# Grouped Window Functions:
# Grouped window functions in Pandas perform calculations on a subset of data grouped by one or more columns. These functions
# can be used to calculate grouped statistics like group mean, group sum, group max, group min, and so on.

In [3]:

# Q7.
import pandas as pd
current = pd.Timestamp.now()
print("Current month and year:", current.strftime("%B %Y"))

Current month and year: February 2023

In [13]:

# Q8. Write a Python program that takes in two dates as input (in the format YYYY-MM-DD) and
# calculates the difference between them in days, hours, and minutes using Pandas time delta. The
# program should prompt the user to enter the dates and display the result.
import pandas as pd 

start_date_str = input("Enter start date (YYYY-MM-DD): ")
end_date_str = input("Enter end date (YYYY-MM-DD): ")

start_date = pd.to_datetime(start_date_str)
end_date = pd.to_datetime(end_date_str)

delta = end_date - start_date

days = delta.days
hours = delta.seconds // 3600
minutes = (delta.seconds % 3600) // 60

print(f"The difference between {start_date_str} and {end_date_str} is {days} days, {hours} hours, and {minutes} minutes.")

Enter start date (YYYY-MM-DD):   2022-01-01
Enter end date (YYYY-MM-DD):  2022-02-28

The difference between  2022-01-01 and 2022-02-28 is 58 days, 0 hours, and 0 minutes.

In [15]:
#Q9.
# import pandas as pd

# # Prompt the user to enter the file path, column name, and category order
# file_path = input("Enter the file path: ")
# column_name = input("Enter the column name to convert: ")
# category_order = input("Enter the category order (comma-separated): ").split(",")

# # Read the CSV file into a DataFrame
# df = pd.read_csv(file_path)

# # Convert the specified column to a categorical data type
# df[column_name] = pd.Categorical(df[column_name], categories=category_order)

# # Sort the data by the specified column
# df_sorted = df.sort_values(by=column_name)

# # Display the sorted data
# print(df_sorted)

In [17]:
# Q10
# import pandas as pd
# import matplotlib.pyplot as plt

# # Prompt the user to enter the file path
# file_path = input("Enter the file path: ")

# # Read the CSV file into a DataFrame
# df = pd.read_csv(file_path)

# # Convert the 'Date' column to a datetime data type
# df['Date'] = pd.to_datetime(df['Date'])

# # Group the data by product category and date, and sum the sales
# df_grouped = df.groupby(['Product Category', 'Date']).sum().reset_index()

# # Pivot the data to create a stacked bar chart
# df_pivot = df_grouped.pivot(index='Date', columns='Product Category', values='Sales')

# # Create the stacked bar chart
# ax = df_pivot.plot(kind='bar', stacked=True)

# # Set the chart title and axis labels
# ax.set_title('Sales by Product Category')
# ax.set_xlabel('Date')
# ax.set_ylabel('Sales')

# # Display the chart
# plt.show()

In [1]:
# Q11.
# import pandas as pd

# # Prompt the user to enter the file path of the CSV file containing the student data
# file_path = input("Enter the file path of the CSV file containing the student data: ")

# # Read the CSV file into a Pandas DataFrame
# df = pd.read_csv(file_path)

# # Calculate the mean, median, and mode of the test scores
# mean_score = df['Test Score'].mean()
# median_score = df['Test Score'].median()
# mode_score = df['Test Score'].mode()

# # Create a table of the results
# results = pd.DataFrame({
#     'Statistic': ['Mean', 'Median', 'Mode'],
#     'Value': [mean_score, median_score, ', '.join(map(str, mode_score))]
# })

# # Display the table
# print(results.to_string(index=False))

In [23]:
# # Q9.
# import pandas as  pd 
# # Prompt the user to enter the file path, column name, and category order
# file_path = input("Enter the file path: ")
# column_name = input("Enter the column name to convert: ")
# category_order = input("Enter the category order (comma-separated): ").split(",")

# #read the file csv
# df = pd.read_csv(file_path)
# # Convert the specified column to a categorical data type
# df[column_name] = pd.Categorical(df[column_name], categories=category_order)

# # Sort the data by the specified column
# df_sorted = df.sort_values(by=column_name)

# # Display the sorted data
# print(df_sorted)

In [21]:
import pandas as pd

In [22]:
file_path = input("Enter the file path: ")

file = pd.read_csv(file_path)

Enter the file path:  taxonomy.csv

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]